var express = require('express');
var path = require('path');
var favicon = require('serve-favicon');
var logger = require('morgan');
var cookieParser = require('cookie-parser');
var bodyParser = require('body-parser');

var index = require('./routes/index');
var users = require('./routes/users');

var app = express();

// view engine setup
/*app.set('views', path.join(__dirname, 'views'));
app.set('view engine', 'jade');*/
app.use(express.static(path.join(__dirname,'music')));

// uncomment after placing your favicon in /public
//app.use(favicon(path.join(__dirname, 'public', 'favicon.ico')));
/*app.use(logger('dev'));
app.use(bodyParser.json());
app.use(bodyParser.urlencoded({ extended: false }));
app.use(cookieParser());
app.use(express.static(path.join(__dirname, 'public')));

app.use('/', index);
app.use('/users', users);*/
app.get('/all',function(req,res){
    res.header('Access-Control-Allow-Origin','*');
    //find.findByConditions();
    console.log('haha')
    res.send([{
        "_id" : "51030319960625001x",
        "name" : "慢慢喜欢你",
        "artist":"莫文蔚",
        "duration" : "03:25",
        "filename":"../static/music/1.mp3",
        "lrc":"[00:00.10]莫文蔚 - 慢慢喜欢你\n"+
              "[00:00.81]作词：李荣浩\n"+
              "[00:00.97]作曲：李荣浩\n"+
              "[00:01.12]编曲：冯翰铭AlexFung\n"+
              "[00:01.27]制作：荒井十一\n"+
              "[00:01.48]书里总爱写到喜出望外的傍晚\n"+
              "[00:09.65]骑的单车还有他和她的对谈\n"+
              "[00:16.62]女孩的白色衣裳男孩爱看她穿\n"+
              "[00:24.48]好多桥段\n"+
              "[00:26.25]好多都浪漫\n"+
              "[00:28.12]好多人心酸\n"+
              "[00:29.99]好聚好散\n"+
              "[00:32.39]好多天都看不完\n"+
              "[00:38.31]刚才吻了你一下你也喜欢对吗\n"+
              "[00:46.32]不然怎么一直牵我的手不放\n"+
              "[00:53.57]你说你好想带我回去你的家乡\n"+
              "[01:01.35]绿瓦红砖\n"+
              "[01:03.02]柳树和青苔\n"+
              "[01:05.00]过去和现在\n"+
              "[01:06.77]都一个样\n"+
              "[01:09.10]你说你也会这样\n"+
              "[01:15.38]慢慢喜欢你\n"+
              "[01:17.92]慢慢的亲密\n"+
              "[01:19.70]慢慢聊自己\n"+
              "[01:21.53]慢慢和你走在一起\n"+
              "[01:25.25]慢慢我想配合你\n"+
              "[01:27.88]慢慢把我给你\n"+
              "[01:30.32]慢慢喜欢你\n"+
              "[01:32.56]慢慢的回忆\n"+
              "[01:34.38]慢慢的陪你慢慢的老去\n"+
              "[01:40.62]因为慢慢是个最好的原因\n"+
              "[02:03.12]晚餐后的甜点就点你喜欢的吧\n"+
              "[02:11.34]今晚就换你去床的右边睡吧\n"+
              "[02:18.49]这次旅行我还想去上次的沙滩\n"+
              "[02:26.27]球鞋手表\n"+
              "[02:27.95]袜子和衬衫都已经烫好\n"+
              "[02:31.57]放行李箱\n"+
              "[02:34.05]早上等着你起床\n"+
              "[02:40.01]慢慢喜欢你\n"+
              "[02:42.96]慢慢的亲密\n"+
              "[02:44.59]慢慢聊自己\n"+
              "[02:46.41]慢慢和你走在一起\n"+
              "[02:50.21]慢慢我想配合你\n"+
              "[02:52.55]慢慢把我给你\n"+
              "[02:55.24]慢慢喜欢你\n"+
              "[02:57.51]慢慢的回忆\n"+
              "[02:59.33]慢慢的陪你慢慢的老去\n"+
              "[03:05.72]因为慢慢是个最好的原因\n"+
              "[03:19.33]书里总爱写到喜出望外的傍晚\n",
        "poster":"http://img.zybus.com/uploads/allimg/140922/1-1409221J045.jpg"
    },
    {
        "_id" : "51030319960625002x",
        "name" : "成全",
        "artist":"刘若英",
        "duration" : "04:35",
        "filename":"../../static/music/2.mp3",
        "lrc":"[00:00.28]成全\n"+
              "[00:01.65]作词：施立、陈没\n"+
              "[00:02.88]作曲：陈小霞\n"+
              "[00:04.50]演唱：刘若英\n"+　
              "[00:05.74]\n"+
              "[00:12.50]看着你和她走到我面前\n"+
              "[00:17.34]微笑地对我说声好久不见\n"+
              "[00:23.79]如果当初没有我的成全\n"+
              "[00:28.62]是不是今天还在原地盘旋\n"+
              "[00:34.53]\n"+
              "[00:35.13]不为了勉强可笑的尊严\n"+
              "[00:40.16]所有的悲伤丢在分手那天\n"+
              "[00:46.63]未必永远才算爱得完全\n"+
              "[00:51.61]一个人的成全\n"+
              "[00:53.09]好过三个人的纠结\n"+
              "[00:55.94]\n"+
              "[00:58.79]我对你付出的青春这么多年\n"+
              "[01:04.54]换来了一句谢谢你的成全\n"+
              "[01:10.04]成全了你的潇洒与冒险\n"+
              "[01:15.84]成全了我的碧海蓝天\n"+
              "[01:21.22]\n"+
              "[01:21.59]她许你的海誓山盟蜜语甜言\n"+
              "[01:27.36]我只有一句不后悔的成全\n"+
              "[01:32.98]成全了你的今天与明天\n"+
              "[01:38.70]成全了我的下个夏天\n"+
              "[01:46.83]\n"+
              "[01:58.01]不为了勉强可笑的尊严\n"+
              "[02:02.94]所有的悲伤丢在分手那天\n"+
              "[02:09.41]未必永远才算爱得完全\n"+
              "[02:14.37]一个人的成全\n"+
              "[02:15.86]好过三个人的纠结\n"+
              "[02:19.53]\n"+
              "[02:21.69]我对你付出的青春这么多年\n"+
              "[02:27.23]换来了一句谢谢你的成全\n"+
              "[02:32.87]成全了你的潇洒与冒险\n"+
              "[02:38.68]成全了我的碧海蓝天\n"+
              "[02:44.08]\n"+
              "[02:44.43]她许你的海誓山盟蜜语甜言\n"+
              "[02:50.10]我只有一句不后悔的成全\n"+
              "[02:55.71]成全了你的今天与明天\n"+
              "[03:01.44]成全了我的下个夏天\n"+
              "[03:07.84]\n"+
              "[03:30.42]我对你付出的青春这么多年\n"+
              "[03:35.84]换来了一句谢谢你的成全\n"+
              "[03:41.50]成全了你的潇洒与冒险\n"+
              "[03:47.13]成全了我的碧海蓝天\n"+
              "[03:52.70]\n"+
              "[03:52.99]她许你的海誓山盟蜜语甜言\n"+
              "[03:58.65]我只有一句不后悔的成全\n"+
              "[04:04.22]成全了你的今天与明天\n"+
              "[04:10.12]成全了我的下个夏天\n"+
              "[04:18.73]\n",
        "poster":"http://a.vpimg3.com/upload/merchandise/pdcvis/2018/05/12/187/fc0c5b07-3c51-4b63-9cfd-53595094d74e.jpg"
    },{
            "_id" : "51030319960625003x",
            "name" : "最美的期待",
            "artist":"周笔畅",
            "duration" : "03:12",
            "filename":"../../static/music/3.mp3",
            "lrc":"[00:02.21]周笔畅 - 最美的期待\n"+
                  "[00:03.68]作词：南征北战NZBZ\n"+
                  "[00:04.99]作曲：南征北战NZBZ\n"+
                  "[00:06.41]制作人：南征北战NZBZ\n"+
                  "[00:08.09]总策划：王烨杨\n"+
                  "[00:09.31]发行人：桑爱\n"+
                  "[00:20.37]我有一个梦\n"+
                  "[00:22.80]像雨后彩虹\n"+
                  "[00:25.09]用所有泪水\n"+
                  "[00:26.92]换来笑容\n"+
                  "[00:29.91]还有一种爱\n"+
                  "[00:32.20]穿越了人海\n"+
                  "[00:34.67]拾起那颗迷失的尘埃\n"+
                  "[00:39.54]你的呼吸\n"+
                  "[00:41.87]越靠越近\n"+
                  "[00:44.35]将我抱紧\n"+
                  "[00:49.30]我睁开双眼\n"+
                  "[00:51.48]想你在身边\n"+
                  "[00:53.86]无所谓永远还是瞬间\n"+
                  "[00:58.73]静闭上了眼\n"+
                  "[01:01.26]你却又浮现\n"+
                  "[01:03.64]带我远离寂寞的边缘\n"+
                  "[01:08.23]忘了是非\n"+
                  "[01:10.66]没有伤悲\n"+
                  "[01:13.04]无怨无悔\n"+
                  "[01:17.96]我拥抱着爱\n"+
                  "[01:20.30]当从梦中醒来\n"+
                  "[01:22.85]你执着地等待\n"+
                  "[01:25.28]却不曾离开\n"+
                  "[01:27.71]舍不得分开\n"+
                  "[01:29.90]在每一次醒来\n"+
                  "[01:32.23]不用再徘徊\n"+
                  "[01:34.77]你就是我最美的期待\n"+
                  "[02:01.04]我睁开双眼\n"+
                  "[02:03.57]想你在身边\n"+
                  "[02:05.90]无所谓永远还是瞬间\n"+
                  "[02:10.67]静闭上了眼\n"+
                  "[02:13.27]你却又浮现\n"+
                  "[02:15.65]带我远离寂寞的边缘\n"+
                  "[02:20.28]忘了是非\n"+
                  "[02:22.61]没有伤悲\n"+
                  "[02:24.94]无怨无悔\n"+
                  "[02:29.91]我拥抱着爱\n"+
                  "[02:32.50]当从梦中醒来\n"+
                  "[02:35.08]你执着地等待却不曾离开\n"+
                  "[02:39.48]舍不得分开\n"+
                  "[02:41.91]在每一次醒来\n"+
                  "[02:44.30]不用再徘徊\n"+
                  "[02:47.00]你就是我最美的期待\n"+
                  "[02:49.93]我拥抱着爱\n"+
                  "[02:51.61]当从梦中醒来\n"+
                  "[02:54.04]你执着地等待却不曾离开\n"+
                  "[02:58.91]舍不得分开\n"+
                  "[03:01.19]在每一次醒来\n"+
                  "[03:03.62]不用再徘徊\n"+
                  "[03:06.10]你就是我最美的期待\n",
            "poster":"https://b-ssl.duitang.com/uploads/item/201503/15/20150315223112_sVtRF.jpeg"

    },
    {
        "_id" : "51030319960625004x",
        "name" : "恶作剧",
        "artist":"林依晨",
        "duration" : "04:46",
        "filename":"../../static/music/4.mp3",
        "lrc":"[00:00.56]你(吉他甜蜜版) - 林依晨\n"+
              "[00:07.80]词曲:蓝又时\n"+
              "[00:15.42]制作人 David碧咸\n"+
              "[00:37.31]风轻轻 我听见你声音\n"+
              "[00:44.33]你对着我叮咛 要注意自己的心情\n"+
              "[00:52.41]雨轻轻 我听见你声音\n"+
              "[00:58.75]你拿着伞靠近 为我遮着风挡着雨\n"+
              "[01:06.53]一点点想哭泣一点点想着你\n"+
              "[01:10.22]你的爱很珍惜\n"+
              "[01:13.49]我总依赖着你的记忆\n"+
              "[01:19.99]你就像风在说话 顺着我方向\n"+
              "[01:27.16]你就像海中的波浪 堆着我成长\n"+
              "[01:34.30]我明白你的回答 温柔的对话\n"+
              "[01:41.60]爱情其实没有办法 不被感动吧 我不说谎\n"+
              "[02:18.45]风轻轻 我听见你声音\n"+
              "[02:24.80]你对着我叮咛 要注意自己的心情\n"+
              "[02:32.89]雨轻轻 我听见你声音\n"+
              "[02:39.40]你拿着伞靠近 为我遮着风挡着雨\n"+
              "[02:47.90]一点点想哭泣一点点想着你\n"+
              "[02:51.54]你的爱很珍惜\n"+
              "[02:56.05]我总依赖着你的记忆\n"+
              "[03:01.86]你就像风在说话 顺着我方向\n"+
              "[03:09.13]你就像海中的波浪 堆着我成长\n"+
              "[03:16.38]我明白你的回答 温柔的对话\n"+
              "[03:23.62]爱情其实没有办法 不被感动吧 我不说谎\n"+
              "[03:45.57]你就像风在说话 顺着我方向\n"+
              "[03:52.78]你就像海中的波浪 堆着我成长\n"+
              "[04:00.01]我明白你的回答 温柔的对话\n"+
              "[04:07.30]爱情其实没有办法 不被感动吧 我不说谎\n"+
              "[04:22.52]我不说谎\n"+
              "[04:31.02]我不说谎\n"+
              "[04:43.65]制作人 David碧咸\n",
        "poster":"https://gss0.bdstatic.com/94o3dSag_xI4khGkpoWK1HF6hhy/baike/w%3D268%3Bg%3D0/sign=efd37e6c79cf3bc7e800caeae93bdd9c/bf096b63f6246b6084e93015e2f81a4c500fa2e8.jpg"
    }
    ])
})

// catch 404 and forward to error handler
/*app.use(function(req, res, next) {
  var err = new Error('Not Found');
  err.status = 404;
  next(err);
});

// error handler
app.use(function(err, req, res, next) {
  // set locals, only providing error in development
  res.locals.message = err.message;
  res.locals.error = req.app.get('env') === 'development' ? err : {};

  // render the error page
  res.status(err.status || 500);
  res.render('error');
});*/
module.exports = app;
